import json
# импортирую модуль json


def json_sum() -> float:
    # создаю программу task указываю в анатации
    # что она возвращает значение float(число с плавающей точкой), функция не
    # принимает никаких значений и не имеет значений по умолчанию
    namefile = "input.json"
    # создаю переменную namefile передаю туда
    # название файла(для открытия) в виде строки "input.json"(так можно
    # будет менять название файла если потребуется и открыть другой файл)
    with open(namefile) as working_file:
        # запускаю менеджер контекста, передаю
        # ему агрументы: 1) название файла перез переменную namefile;
        # 2) режим доступа к файлу не указываю (по умолчанию чтение 'r';
        # 3) режим работы не указываю (по умолчанию 't' текстовый);
        # кодировку encoding='...' не указываю;
        # working_file("input.json") рабочий файл
        json_fale_data = json.load(working_file)
        # создаю обьект в питоне методом load выполняю чтение данных из рабочего
        # файла working_file в формате JSON и десериализацию их в объект Python.

    sum_values = sum([item["score"] * item["weight"] for item in json_fale_data])
    # создаю переменную sum_values, присваиваю ей в значение  сумму списка произведений
    # значений по ключам "score" и "weight", список произведений значений по ключам
    # формирую при помощи list comprehension перебирая циклом for значения item
    # в созданом ранее обьекте пайтон json_fale_data через in
    return round(sum_values, 3)
    # при помощи фунции round округляю значение переменной sum_values до 3
    # значения после запятой, и возвзащаю результат работы всей функции task
    # командой return


print(json_sum())
# распечатываю результат работы функции json_sum